### Standard Kegs
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'caskroom/fonts'
#tap 'homebrew/fuse'

# helpful scripts tap
# https://github.com/github/homebrew-bootstrap
tap 'github/bootstrap'

# cloudfoundry tap
tap 'cloudfoundry/tap'

# env tools
brew 'nodenv'
brew 'node-build'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'ruby-build'
brew 'jenv'
#git tools!
brew 'git'
brew 'git-tracker'

# TODO: maybe I should use the setup script?
brew 'nginx'

# font casks!
cask 'font-sourcecodepro-nerd-font'
cask 'font-anonymouspro-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'font-firamono-nerd-font'
cask 'font-firacode-nerd-font'

#casks!
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'vivaldi'
cask 'keybase'
cask 'skitch'
cask 'vagrant'
cask 'vlc'
cask 'borgbackup'
cask 'chefdk'
cask 'clementine'
cask 'dropbox'
cask 'filezilla'
cask 'gfxcardstatus'
cask 'hermes'
cask 'java'
cask 'kdiff3'
cask 'libreoffice'
cask 'magicprefs'
cask 'moom'
cask 'nosleep'
cask 'skim'
cask 'slack'
cask 'virtualbox'
cask 'xscreensaver'
cask 'google-cloud-sdk'

# gotta have these for building
brew 'autoconf'
brew 'automake'
brew 'openssl'

# brews!
### Better copy/paste with tmux 
brew 'reattach-to-user-namespace', args: ['with-wrap-pbcopy-and-pbpaste']
brew 'tmux'

brew 'cf-cli'
brew 'dnsmasq'
brew 'fish'
brew 'gnupg'
brew 'gpg-agent'
brew 'gpgme'


# Utilities
brew 'htop'
brew 'jq'
brew 'mtr'
brew 'multitail'
brew 'p7zip'
brew 'pv'
brew 'pwgen'
brew 'slackcat'
brew 'socat'
brew 'spark'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'xz'
brew 'findutils'
brew 'the_silver_searcher'
brew 'msmtp'
brew 'offlineimap', restart_service: true
brew 'notmuch'

